Public Attributes | List of all members
API_PrintStampType Struct Reference
Project Operations
Printing header/footer parameters. More...
#include <APIdefs_Automate.h>
 Public Attributes
bool  | addProjectName
Add project's name to stamp.
bool  | addProjectPath
Add project's path to stamp.
bool  | addViewName
Add view's name to stamp.
bool  | addLayerComb
Add layer combination to stamp.
bool  | addDispOptComb
Add display options combination to stamp.
bool  | addPrintingScale
Add scale value to stamp.
bool  | addLoginName
Add login name to stamp.
bool  | addDateTime
Add current date and time to stamp.
bool  | addPageNumber
Add page number to stamp.
bool  | addCustomText
Add custom text to stamp.
char  | customText [256]
User text.
API_AnchorID  | position
Position of the stamp. Invalid positions: APIAnc_LM, APIAnc_MM, APIAnc_RM.
short  | fontID
Index of the stamp's font.
double  | fontHeight
Height of the stamp's font in paper mms.
Detailed Description
Printing header/footer parameters.
Remarks
To utilize this structure, see the API_PrintPars structure.
Member Data Documentation
◆ addCustomText
 API_PrintStampType::addCustomText
Add custom text to stamp.
◆ addDateTime
 API_PrintStampType::addDateTime
Add current date and time to stamp.
◆ addDispOptComb
 API_PrintStampType::addDispOptComb
Add display options combination to stamp.
◆ addLayerComb
 API_PrintStampType::addLayerComb
Add layer combination to stamp.
◆ addLoginName
 API_PrintStampType::addLoginName
Add login name to stamp.
◆ addPageNumber
 API_PrintStampType::addPageNumber
Add page number to stamp.
◆ addPrintingScale
 API_PrintStampType::addPrintingScale
Add scale value to stamp.
◆ addProjectName
 API_PrintStampType::addProjectName
Add project's name to stamp.
◆ addProjectPath
 API_PrintStampType::addProjectPath
Add project's path to stamp.
◆ addViewName
 API_PrintStampType::addViewName
Add view's name to stamp.
◆ customText
 API_PrintStampType::customText
User text.
◆ fontHeight
 API_PrintStampType::fontHeight
Height of the stamp's font in paper mms.
◆ fontID
 API_PrintStampType::fontID
Index of the stamp's font.
◆ position
 API_PrintStampType::position
Position of the stamp. Invalid positions: APIAnc_LM, APIAnc_MM, APIAnc_RM.